app/views/notes/index.html.erb

SELECT "notes".* FROM "notes" WHERE (title LIKE '%nota%' ESCAPE '\') AND (title LIKE '%esta%' ESCAPE '\') AND (title LIKE '%una%' ESCAPE '\') AND (title LIKE '%es%' ESCAPE '\') ORDER BY "notes"."created_at" DESC
---
            <%= form_with url: notes_path, method: :get, html: { class: 'input-field select-dropdown game', id: 'orderForm' } do |f| %>
            <%= f.select :order, options_for_select([
              [t('notes.sorting.newest_first'), 'newest_first'],
              [t('notes.sorting.oldest_first'), 'oldest_first'],
              [t('notes.sorting.alphabetical_asc'), 'alphabetical_asc'],
              [t('notes.sorting.alphabetical_desc'), 'alphabetical_desc']
            ], selected: params[:order]), { class: 'browser-default', name: "order" } %>