app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes" WHERE (title LIKE '%nota%' ESCAPE '\') AND (title LIKE '%esta%' ESCAPE '\') AND (title LIKE '%una%' ESCAPE '\') AND (title LIKE '%es%' ESCAPE '\') ORDER BY "notes"."created_at" DESC
SELECT "notes".* FROM "notes" ORDER BY "notes"."created_at" DESC
SELECT "notes".* FROM "notes" WHERE (title LIKE '%Este%' ESCAPE '\') ORDER BY "notes"."created_at" DESC
INSERT INTO "notes" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "¡OMG!"], ["body", "Realmente increible esta prueba"], ["created_at", "2024-12-10 21:52:03.417387"], ["updated_at", "2024-12-10 21:52:03.417387"]]
SELECT "notes".* FROM "notes" WHERE (LOWER(title) LIKE '%texto%' OR LOWER(body) LIKE '%texto%') ORDER BY "notes"."created_at" DESC
---
  def index
    @notes = Note.all

    case params[:order]
    when 'newest_first'
      @notes = @notes.order(created_at: :desc)
    when 'oldest_first'
      @notes = @notes.order(created_at: :asc)
    when 'alphabetical_asc'
      @notes = @notes.order(:title)
    when 'alphabetical_desc'
      @notes = @notes.order(title: :desc)
    else
      @notes = @notes.order(created_at: :desc)
    end

    if params[:query].present?
      @notes = @notes.search_by_query(params[:query])
    end

    @grouped_notes = @notes.group_by { |note| note.created_at.strftime('%B %Y') }

INSERT INTO "notes" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @note = Note.new(note_params)

    respond_to do |format|
      if @note.save

UPDATE "notes" SET "title" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["title", "MUY NUEVOOO"], ["updated_at", "2024-12-11 00:03:56.438053"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @note.update(note_params)